; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	image1 - mode
	infrared2 - mode
	infrared4 - mode
	infrared3 - mode
	image0 - mode
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 infrared3)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star3)
	(supports instrument2 image1)
	(supports instrument2 infrared4)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared2)
	(supports instrument4 image1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared3)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument8 infrared3)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star3)
	(supports instrument9 image1)
	(calibration_target instrument9 Star3)
	(supports instrument10 image0)
	(supports instrument10 infrared4)
	(supports instrument10 infrared3)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument11 image0)
	(supports instrument11 infrared2)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 infrared3)
	(supports instrument12 infrared4)
	(supports instrument12 infrared2)
	(calibration_target instrument12 GroundStation2)
	(supports instrument13 image0)
	(calibration_target instrument13 GroundStation2)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(pointing satellite2 Star14)
	(pointing satellite4 Star3)
	(have_image Planet4 image0)
	(have_image Star5 infrared2)
	(have_image Star6 infrared2)
	(have_image Star7 infrared3)
	(have_image Star8 image1)
	(have_image Planet9 image1)
	(have_image Star10 infrared4)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 infrared4)
	(have_image Phenomenon13 infrared4)
	(have_image Star14 image0)
	(have_image Phenomenon15 infrared2)
	(have_image Phenomenon16 image0)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 15
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 15
3. (calibrate satellite3 instrument8 star3)
   added: (calibrated instrument8)
   goals met: 0 of 15
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 15
5. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 15
6. (turn_to satellite4 star3 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star3)
   goals met: 1 of 15
7. (turn_to satellite3 phenomenon15 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon15)
   goals met: 1 of 15
8. (take_image satellite3 phenomenon15 instrument8 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 2 of 15
9. (turn_to satellite3 star5 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 star5)
   goals met: 2 of 15
10. (take_image satellite3 star5 instrument8 infrared2)
   added: (have_image star5 infrared2)
   goals met: 3 of 15
11. (turn_to satellite3 star6 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star6)
   goals met: 3 of 15
12. (take_image satellite3 star6 instrument8 infrared2)
   added: (have_image star6 infrared2)
   goals met: 4 of 15
13. (turn_to satellite3 star7 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star7)
   goals met: 4 of 15
14. (take_image satellite3 star7 instrument8 infrared3)
   added: (have_image star7 infrared3)
   goals met: 5 of 15
15. (turn_to satellite2 groundstation0 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 groundstation0)
   goals met: 5 of 15
16. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 5 of 15
17. (turn_to satellite2 phenomenon11 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon11)
   goals met: 5 of 15
18. (take_image satellite2 phenomenon11 instrument5 image1)
   added: (have_image phenomenon11 image1)
   goals met: 6 of 15
19. (turn_to satellite2 phenomenon16 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon16)
   goals met: 6 of 15
20. (take_image satellite2 phenomenon16 instrument5 image0)
   added: (have_image phenomenon16 image0)
   goals met: 7 of 15
21. (turn_to satellite2 planet4 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet4)
   goals met: 7 of 15
22. (take_image satellite2 planet4 instrument5 image0)
   added: (have_image planet4 image0)
   goals met: 8 of 15
23. (turn_to satellite2 planet9 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 planet9)
   goals met: 8 of 15
24. (take_image satellite2 planet9 instrument5 image1)
   added: (have_image planet9 image1)
   goals met: 9 of 15
25. (turn_to satellite2 star14 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star14)
   goals met: 10 of 15
26. (take_image satellite2 star14 instrument5 image0)
   added: (have_image star14 image0)
   goals met: 11 of 15
27. (turn_to satellite0 star3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star3)
   goals met: 11 of 15
28. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 11 of 15
29. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 11 of 15
30. (take_image satellite0 phenomenon12 instrument1 infrared4)
   added: (have_image phenomenon12 infrared4)
   goals met: 12 of 15
31. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 12 of 15
32. (take_image satellite0 phenomenon13 instrument1 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 13 of 15
33. (turn_to satellite0 star10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star10)
   goals met: 13 of 15
34. (take_image satellite0 star10 instrument1 infrared4)
   added: (have_image star10 infrared4)
   goals met: 14 of 15
35. (turn_to satellite2 star8 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star8)
   goals met: 13 of 15
36. (take_image satellite2 star8 instrument5 image1)
   added: (have_image star8 image1)
   goals met: 14 of 15
37. (turn_to satellite2 star14 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star14)
   goals met: 15 of 15
